[
	{
		"composer": "Kikuya Tomoki (菊谷知樹)", 
		"series": "Hidamari Sketch (ひだまりスケッチ)",
		"rating": "5 stars",
		"notes": "a most excellent soundtrack. many catchy, memorable melodies with quite a bit of jazz/bossa nova elements. great for stand-alone listening. a couple of pieces, such as 'a sunny place', is a recurring theme that shows up in a couple of other variations. my favorite track is probably 'waku waku', which features a really cool jazz clarinet melody.",
		"image": "http://medium.media.vgm.io/albums/67/20876/20876-1283025736.jpg",
		"spNote": "Note that 'Hidamari Sketch x365' and 'Hidamari Sketch Hoshimittsu' each have their own soundtrack, both of which are as excellent as this one!"
	},
	{
		"composer": "Misawa Yasuhiro (三澤 康広)", 
		"series": "Yuru Yuri (ゆるゆり)",
		"rating": "4 stars",
		"notes": "Mr. Misawa's music is often particularly distinctive (his style becomes clear I think when listening to his other works, such as from 'Minami-ke' and 'Kotoura-San'), and well-suited for background music. despite being bgm, his work for 'Yuru Yuri' contains some very nice melodies, and many of the pieces have enough depth from a real string ensemble and woodwind instruments, as well as flavor from his compositional style, to be enjoyed without much context.",
		"image": "http://medium.media.vgm.io/albums/01/28510/28510-1332665552.jpg",
		"spNote": ""
	},
	{
		"composer": "Franz Maxwell I.", 
		"series": "Denpa Onna To Seishun Otoko (電波女と青春男)",
		"rating": "4 stars",
		"notes": "Denpa Onna's music is, overall, quite standard I would say. That is not to say it's not worth having in my collection. Ryuuko's theme is notable - a simple, waltz-like 'ditzy' piano piece in three-quarters time is a perfect fit for her character. Maekawa's theme embodies her being somewhat of a troublesome cosplayer through a mildly frantic-sounding symphonic march. Unfortunately, many of the sounds are synthetic; however, the blending of their sounds produces an acceptable quality, at least to me.",
		"image": "http://medium.media.vgm.io/albums/55/26155/26155-1308924599.jpg",
		"spNote": "This soundtrack actually has two volumes, with each being bundled with a particular vol. of the DVD/Blu-Ray release. Both were included in the Denpa Onna to Seishun Otoko Blu-Ray Box."
	},
	{
		"composer": "Oshima Michiru (大島ミチル)", 
		"series": "The Tatami Galaxy (四畳半神話大系)",
		"rating": "4 stars",
		"notes": "Ms. Oshima's style feels very 'impressionist', like Debussy, which fits this anime very well. Watashi's theme is a very nice one to pay attention to. at times reminiscent of old movie music like from 'Ben Hur' by Miklos Rozsa. Additionally, the pieces in this soundtrack are fairly well-developed and not just little bits of sound here-and-there, like how background music is sometimes. There is a strong, cohesive and thematic element here.",
		"image": "http://medium.media.vgm.io/albums/15/20951/20951-1283400311.jpg",
		"spNote": ""
	},
	{
		"composer": "Kosaki Satoru (神前 暁)", 
		"series": "Bakemonogatari (化物語)",
		"rating": "3 and a half stars",
		"notes": "a few pretty good pieces, and also a few pretty boring tracks that are generally not stand-alone worthy. one notable track is the piano arrangement of 'staple stable'. wow. after watching 11 episodes and hearing it in context- I was very moved. By the way, Mr. Kosaki also did all the opening songs (5 of them if I recall correctly) - all which are catchy and well composed.",
		"image": "http://medium.media.vgm.io/albums/29/28892/28892-1324464284.jpg",
		"spNote": "The soundtrack was divided up originally into separate albums and bundled with certain DVD volumes. A full album, along with the character songs, was released in 2011."
	},
	{
		"composer": "Kato Tatsuya (加藤 達也)",
		"series": "Sora no Method (天体のメソッド)",
		"rating": "3 and a half stars",
		"notes": "an assortment of nice, light music (a few sound like they could fit perfectly in a commercial), with an abundance of guitar, piano, and strings. a couple of heavy pieces for the dark moods, but no particularly interesting themes.",
		"image": "http://medium.media.vgm.io/albums/16/48561/48561-1420762403.png",
		"spNote": ""
	},
	{
		"composer": "Matsuda Akito (松田 彬人)",
		"series": "Glasslip (グラスリップ)",
		"rating": "5 stars",
		"notes": "wow. this is a gem. even though 'Glasslip' was pretty boring and had some strange character dynamics that turned me away the first time around, the music really stood out. Mr. Matsuda's writing ability for strings, especially quartets, is exceptional. \n\nThe prominent themes throughtout the anime are represented mainly through a string quartet, written in very authentic-sounding 'classical' style. This was the first time I had heard 'classical' music written in today's time that resembled Classical period music so well. \n\nadditionally, for the more modern pieces, the use of woodwinds, orchestra, and piano are blended to create very rich harmonies and exciting melodies. There is one piece, which feels like a mini piano concerto, that's a bit over 9 minutes. much impressed.",
		"image": "http://medium.media.vgm.io/albums/30/46803/46803-1411478833.jpg",
		"spNote": ""
	},
	{
		"composer":"Kosaki Satoru (神前 暁)",
		"series":"Lucky Star (らき☆すた)",
		"rating":"4 stars",
		"notes":"very nice soundtrack. there's lots of happy, upbeat music, some more serious piano/string pieces, and some regular bgm stuff. a couple of recurrent melodies are present, such as Konata's theme. my favorite track is probably 'Ran Ran Ran dayo' (especially because of the trumpet part ^^). I think it sounds a bit like some of the Beatles' music, which is not surprising since if I recall correctly Mr. Kosaki is a Beatles fan.",
		"spNote": "awww man! there is actually no 'Lucky Star' soundtrack album. The tracks were bundled with various volumes of the DVD release. :<"
	},
	{
		"composer":"Yokoyama Masaru (横山 克)",
		"series":"Acchi Kocchi (あっちこっち)",
		"rating":"3 and a half stars",
		"notes":"pretty standard fare. There are many tracks I would consider to be 'pure' BGM, in that they're there mostly for effect, pretty short, and are pretty meaningless without some visual context. However, there are some really nice themes, with one in particular called 'fuka fukaaaa!!', which is a solo piano piece featuring what I believe to be Tsumiki's theme. ",
		"image": "http://medium.media.vgm.io/albums/36/32363/32363-1340860826.jpg",
		"spNote": ""
	},
	{
		"composer":"Hamaguchi Shiro (浜口 史郎)",
		"series":"Girls und Panzer (ガールズ&パンツァー)",
		"rating":"4 stars",
		"notes":"Not bad! A good mix of military-ish music, with arrangements of military music from around the world (i.e. the British Grenadiers march, the US Field Artillery march, etc.), typical battle music, fanfare-ish/triumphal music, and some regular light music you'd normally hear in a 'slice-of-life' anime. There are some good, easy-to-recognize leitmotifs throughout the soundtrack which can be heard in various forms depending on the context (sometimes it gets a bit repetitive though). \n\nOne small gripe I have though is maybe the mixing/personnel choices for the music. While it's great they have real musicians and instruments performing, I feel that sometimes the trumpets come off a bit too strong and don't blend quite well with the other instruments.",
		"image":"http://medium.media.vgm.io/albums/77/35777/35777-1357659231.png",
		"spNote": ""
	},
	{
		"composer":"Iwasaki Taku (岩崎 琢)",
		"series":"Katanagatari (刀語)",
		"rating":"4 and a half stars",
		"notes":"Excellent! Mr. Iwasaki is definitely a unique composer whose style is fairly easily recognizable. Along with generally creating more modern compositions accompanying rap (usually done by Lotus Juice, I think), his orchestral writing I would say is very much on par with film scores done by the top names in the industry, i.e. Joe Hisaishi. \n\nThere are some great themes that get developed in this soundtrack - one of my favorites is Togame's theme. There are a few pieces that are rock and/or electronic based, which adds more flavor to the soundtrack. All in all, there's a great mix of styles and really amazing themes that make this album great for standalone listening. \n\nAlso, there's some interesting instrumentation to look out for, such as the erhu and a Southeast Asian percussion instrument called 'angklung' (it's quite prominent in Nanami's theme).",
		"image":"http://medium.media.vgm.io/albums/13/21831/21831-1299877366.jpg",
		"spNote": "There's enough music that the soundtrack was split into two volumes."
	},
	{
		"composer":"Yokoyama Masaru (横山 克)",
		"series":"Joshiraku (じょしらく)",
		"rating":"4 stars",
		"notes":"overall a very nice selection of music. Mr. Yokoyama uses a lot of violin and clarinet, both which pair very well. The music is a bit similar to his work in \"Acchi Kocchi\", so quite a few of the pieces are short and unsurprising background music. There are at least a couple motifs to look out for, and the instrumentation at times is unique (i.e. various percussion instruments and sound effects).",
		"image":"http://medium.media.vgm.io/albums/33/37533/37533-1363192482.png",
		"spNote":"The soundtrack can be found bundled with sixth DVD volume, or the Blu-Ray box."
	},
	{
		"composer":"Miyazaki Shinji (宮崎 慎二)",
		"series":"Pokémon Ranger and the Temple of the Sea Movie",
		"rating":"5 stars",
		"notes":"This soundtrack is really special. Besides being one of the first soundtracks (other than John T. Williams' work) that I really paid attention to, this one has one really amazing theme which shows up quite a few times. \n\nGiven the setting of the movie (tropical), there's some nice steel drum/typical tropical flavor, as well as the usual symphonic orchestral work that can be heard in the anime.\n\nNot sure if all the instruments were real, but I think a little bit of synthetic sounds is what gives the music from Pokémon its charm. But it's the quality of the compositions that count, and this one has it.",
		"image":"http://medium.media.vgm.io/albums/11/19111/19111-1273138238.png",
		"spNote":"The full title of this soundtrack is: \"劇場版ポケットモンスターAG ポケモンレンジャーと蒼海の王子マナフィ ミュージックコレクション\""
	}
]
