{
    "filename": "06-23-24",
    "date": "6/23/24",
    "title": "another trip to Taiwan!",
    "tags": [
        "life",
        "travel"
    ],
    "content": "<p>I went to Taiwan from May 21 - May 27! This time I went to visit Kaohsiung (although I only spent 1 night there) but I got to try new foods and didn't forget the pineapple cakes this time :).\n</p><p>I took Alaska Airlines from IAD to LAX and then EVA Air (economy) from LAX to TPE. Overall the flights were not bad and on time. Although LAX to TPE wasn't as long as last time when I went to HKG from IAD first, it still felt pretty long and tiring lol.\n</p><p>Coming back didn't feel as bad and I think the total flight times were shorter - I went from TPE to SFO and then SFO to IAD.\n</p><p>I had been reviewing and studying Mandarin a bit before the trip so I think I was at least somewhat prepared to face the language barrier more so than last time (especially thanks to my <a href=\"https://github.com/syncopika/flashcard-android-app\"><b>Chinese flashcard mobile app</b></a>). \n</p><p>I did use my Google Pixel 6a's Google Lens feature sometimes which was pretty handy for on-the-fly translating. Additionally, I was really lucky that my T-Mobile data service carried over to Taiwan so I didn't need to get a SIM card (however if you need to make phone calls, you will incur a charge).\n</p><p>Here are some pictures!\n</p><h3>Taipei Main Station (台北車站)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240521_120315927.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/taiwan2024-taipeimainstationticketmachine.webp\" alt=\"\"><p>Taipei Main Station is incredible! A super big place with food shops, restaurants and an amazing, extremely extensive underground mall that's connected to it. \n</p><p>They also updated their ticket machines with a pretty nice touchscreen interface so you don't have to press buttons anymore for the destination you want to go to :D.\n</p><h3>Maokong (貓空)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240523_012937151.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240523_013936195.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240523_020417140.webp\" alt=\"\"><p>I went to Maokong for the first time! The gondola ride was a bit long (at least 20 min.) to Maokong Station from Taipei Zoo. There's lots of\n</p><p>tea places around Maokong Station and they have a special type of Oolong tea there called tie guan yin (鐵觀音).\n</p><br /><h3>some food I tried!\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240522_093634424.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240525_121744969.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240525_121748741.webp\" alt=\"\"><p>I had some wonderful niu rou mian (牛肉麵) from 劉山東牛肉麵 in Taipei! \n</p><p>The 2nd image is bawan (肉圓) and the 3rd image is you guo (油粿, translated as \"oil cake\" in English), both traditional Taiwanese foods. \n</p><p>I got the bawan and you guo from a stall at the night market near Longshan Temple.\n</p><br /><h3>Kaohsiung (高雄)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240524_062001779.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240524_052519640.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240524_074929458.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240524_114951638.webp\" alt=\"\"><p>Above are photos from Kaohsiung. The Dragon and Tiger Pagodas were unfortunately closed due to renovations (I think they're supposed to reopen in 2025) but\n</p><p>there were lots of other temples around to visit (like the Temple of Confucius in the 2nd pic)! \n</p><p>The Lotus Pond was also very nice; it seemed more like a lake and there were loads of fish and turtles.\n</p><p>I also visited Cijin Island via ferry at night but it seemed pretty deserted unfortunately when I got there (which was around 8 pm on a Friday).\n</p><br /><h3>Xiangshan (象山)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240525_085413224.webp\" alt=\"\"><p>I visited Xiangshan again! The view was, unsurprisingly, the same :). The hike though felt more tiring than last time though :0.\n</p><br /><h3>Keelung (基隆) and Jiufen (九份)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240522_033622915.webp\" alt=\"\"><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240526_033018621.webp\" alt=\"\"><p>Above are photos from Keelung and Jiufen. I visited Fort Gongziliao again in Keelung (which is right behind National Taiwan Ocean University).\n</p><p>I was also lucky the weather that day was mostly cooperative, although a bit wet at times.\n</p><br /><h3>Pineapple Cakes! (鳳梨酥)\n</h3><img class=\"\" src=\"blog_entries/images/taiwan trip 2024/PXL_20240609_234140779.webp\" alt=\"\"><p>I love Taiwanese pineapple cakes! Clockwise from top left are the pineapple cakes I got in Taiwan: \n</p><p>Chia-Te (although I bought them in a Family Mart at Taipei Main Station), 泉糕餅 near Songshan Station, a tea shop in front of Maokong Station, 李鵠餅店 in Keelung.\n</p>"
}